test/artillery/performanceTest.yaml
config:
  target: "http://127.0.0.1:3000"
  phases:
    - duration: 120
      arrivalRate: 30
scenarios:
  - flow:
      # - get:
      #     url: "/api/ordersByUser"
      # - get:
      #     url: "/api/ordersByDate"
      - post:
          url: "/api/placeOrder"
          json:
            userid: 70000
            date: '2017-01-05T16:00:00.000Z'
            itemid: 123456
            orderid: 255809
            purchasemethod: 'normal'
            qty: 1234
            rating: 5
            timestamp: '1517697427368'
            totalprice: 1

            # userid, date, itemid, orderid, purchasemethod, qty, rating, timestamp, totalprice